improvement in Redme File
